export const recipes = [

  {
    id: "r1",
    name: "เนื้อแฮมเบอร์เกอร์",
    category: "อาหารคาว",
    ingredients: [
      { name: "เนื้อหมูบดติดมัน", amount: 500, unit: "กรัม" },
      { name: "หอมหัวใหญ่สับละเอียด", amount: 1/2, unit: "ลูก." },
      { name: "ซอสหอยนางรม", amount: 1, unit: "ชต" },
      { name: "ซอสปรุงรส", amount: 1/2, unit: "ชต" },
      { name: "ไข่แดง", amount: 1, unit: "ลูก." },
      { name: "เกล็ดขนมปัง",amount: 2, unit: "ชต" },
      { name: "เกลือ", amount: 1/2, unit: "ชช" },
      { name: "พริกไทยดำป่นหยาบ", amount: 1, unit: "ชช" },
      { name: "น้ำตาลทราย", amount: 1/2, unit: "ชช" },
    ],
  },

    {
    id: "r2",
    name: "ปังอบเนยกระเทียม",
    category: "อาหารคาว",
    ingredients: [
      { name: "เนยสด", amount: 250, unit: "กรัม" },
      { name: "เกลือ", amount: 1/3, unit: "ชช" },
      { name: "กระเทียมสดสับละเอียด", amount: 25, unit: "กรัม" },
      { name: "ผงกระเทียม", amount: 1, unit: "ชช" },
      { name: "ออริกาโน่แห้ง", amount: 2, unit: "กรัม" },
      { name: "พาร์สลีย์แห้ง", amount: 1, unit: "กรัม" },
    ],
  },

  {
    id: "r3",
    name: "อกไก่ย่างนมสด",
    category: "อาหารคาว",
    ingredients: [
      { name: "อกไก่: 2-3 ชิ้น", amount: 3, unit: "ชิ้น" },
      { name: "นมสดรสจืด", amount: 1/2, unit: "ถต" },
      { name: "ซอสหอยนางรม", amount: 2, unit: "ชต" },
      { name: "ซีอิ๊วขาว", amount: 1, unit: "ชต" },
      { name: "น้ำตาลมะพร้าว", amount: 2, unit: "ชช" },
      { name: "พริกไทย", amount: 1, unit: "กรัม" },
      { name: "สามเกลอ", amount: 2, unit: "ชต" },
      { name: "น้ำมัน", amount: 1, unit: "ชต" },
    ],
    steps: [
      "เตรียมไก่: ล้างอกไก่ให้สะอาด ซับให้แห้ง ใช้ส้อมจิ้มให้ทั่วชิ้นไก่ หรือแล่ครึ่งตามขวางให้ความหนาเท่าๆ กัน เพื่อให้สุกไวและน้ำซอสเข้าเนื้อ",
      "หมักไก่: ผสมนมสด สามเกลอ ซอสหอยนางรม ซีอิ๊วขาว น้ำตาล และน้ำมันมะกอกเข้าด้วยกัน นำอกไก่ลงไปคลุกเคล้า หมักทิ้งไว้อย่างน้อย 1 ชั่วโมง",
      "วอร์มเตาอบ: ตั้งอุณหภูมิที่ 200°C เปิดไฟบน-ล่าง เตรียมไว้",
      "การอบ: * วางอกไก่บนตะแกรง (มีถาดรองน้ำด้านล่างเพื่อให้เตาอบมีความชื้น ไก่จะไม่แห้ง)",
      "อบประมาณ 15-20 นาที (ขึ้นอยู่กับความหนาของชิ้นไก่)",
      "เมื่อผ่านไปครึ่งทาง ให้เปิดเตาออกมาทาน้ำหมักที่เหลือบนชิ้นไก่แล้วพลิกด้าน เพื่อให้สีสวยและฉ่ำ",
      "พักเนื้อ: เมื่อสุกแล้วให้นำออกจากเตา พักเนื้อทิ้งไว้ประมาณ 5 นาที ก่อนหั่น เพื่อให้น้ำในเนื้อ (Juice) ไม่ไหลออกมาหมด ไก่จะยังคงความนุ่มอยู่ครับ",
    ],
  },

    {
    id: "r4",
    name: "มันฝรั่งอบ",
    category: "อาหารคาว",
    ingredients: [
      { name: "มันฝรั่ง: 1-2 หัวใหญ่", unit: "ชิ้น" },
      { name: "น้ำมันรำข้าว", amount: 1, unit: "ชช" },
      { name: "เกลือและพริกไทย",  unit: "" },
      { name: "นมพร่องมันเนย", amount: 1, unit: "ชต" },
      { name: "เนย", amount: 2, unit: "ชช" },
    ],
    steps: [
      "ใช้ส้อมจิ้มผิวมันฝรั่งให้ทั่ว (ป้องกันมันระเบิดในเตา)",
      "ทาด้วยน้ำมันมะกอกบางๆ และโรยเกลือเล็กน้อยที่เปลือกห่อฟอยล์ให้มิดชิด เพื่อเก็บความชื้น",
      "นำเข้าเตาอบอุณหภูมิ 200°C นาน 50-60 นาที (เช็กสุกโดยการลองบีบดู ถ้าหัวมันนิ่มยวบตามมือคือใช้ได้)",
      "แกะฟอยล์เฉพาะด้านบนออก ผ่ากลางมันฝรั่งตามยาว (ระวังอย่าให้ขาดออกจากกัน)",
      "ใช้ส้อมค่อยๆ ยีเนื้อข้างในให้ฟู ในขณะที่ยังร้อนจัด (พยายามอย่าให้โดนเปลือกจนขาด)",
      "ใส่ นม/เนย ลงไป พร้อมเกลือและพริกไทยคนผสมให้เนื้อเข้ากันจน เนียน ตามที่คุณต้องการ",
      "พับฟอยล์ให้เป็นทรงถ้วยรองข้างล่างไว้ เปิดหน้ามันฝรั่งไว้สำหรับรอยหน้าและเสริฟ",
    ],
  },
];
